#__________________________________ Шаблоны текста____________________________________________________________

#_____________________MESSAGE_TEXT____________________________________________________________________
SPECIALIST_NAME = "Иван"

FEEDBACK_TEXT = (
f"Пожалуйста, 📝напишите ваши пожелания, замечания,\n🚨опишите проблему или ❓введите ваш вопрос✒️...\n"
)

FEEDBACK_THANK_TEXT = (
f"Спасибо за ваш отзыв! Мы учтем ваши пожелания.\n\n"
)
DESCRIPTION_TEXT = (
    f"Ваш помощник очень внимательно вас выслушает и \nзапишет ваши пожелания просьбы, вопросы, замечания\nмы постараемся исправить проблему в кратчайшие сроки\n"
    f"Нажимайте на кнопку - 🛟Написать обращение и вводите текст💬"
    
)

WELCOME_TEXT = (
    f"👋Привет - я ваш интеллектуальный помощник\n<b>{SPECIALIST_NAME}</b>\n\n"
    f"{DESCRIPTION_TEXT}\n"
)

#_______________BUTTON_______________________________________________________________________________

HELP_BUTTON_CALLBACK = "help"
HELP_BUTTON_TEXT = "🛟Написать обращение"
START_QUERY_CALLBACK = "start_query_process"

START_BUTTON_CALLBACK = "start"
START_BUTTON_TEXT = "🏁Начало работы"

CANCEL_BUTTON_CALLBACK = "cancel"
CANCEL_BUTTON_TEXT = "🚫Отмена"


